FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ns_Магазины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_Магазины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СхемаПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_СхемаПроезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПапкаВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ns_ВидыСобытийЖурнала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ns_ВидыСобытийЖурнала</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаВXML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформированОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаЗавершена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаОтменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаОтмененаПоМагазину</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаНеПолная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаНаFTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбращенияКСерверу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаРаботыМодуля</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ns_Магазины/Ext/ManagerModule.bsl
Процедура СоздатьМагазинПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ns_Магазины.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_Магазины КАК ns_Магазины";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НовыйМагазин = Справочники.ns_Магазины.СоздатьЭлемент();
		НовыйМагазин.Наименование = "Магазин Авито №1";
		НовыйМагазин.ИмяФайлаВыгрузки = "avito.xml";
		НовыйМагазин.ПапкаВыгрузки = "store1";
		НовыйМагазин.Префикс = "st1";
		НовыйМагазин.Записать();
	КонецЕсли;  
	
КонецПроцедуры

Функция ПолучитьТаблицуМагазинов(Повтор = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_Магазины.Наименование КАК Наименование,
	|	ns_Магазины.Ссылка КАК Магазин,
	|	ns_Магазины.Префикс КАК Префикс,
	|	ns_Магазины.Код КАК Код,
	|	ns_Магазины.ПапкаВыгрузки КАК ПапкаВыгрузки,
	|	ns_Магазины.Шаблон КАК Шаблон,
	|	ns_Магазины.СхемаПроезда КАК СхемаПроезда
	|ИЗ
	|	Справочник.ns_Магазины КАК ns_Магазины";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Если Повтор = Ложь Тогда
			СоздатьМагазинПоУмолчанию();
			Возврат ПолучитьТаблицуМагазинов(Истина);
		КонецЕсли; 
		РегистрыСведений.ns_ЖурналАвито.ЗаписатьОшибкуВЖурнал(Перечисления.ns_ВидыСобытийЖурнала.ВыгрузкаОтменена, "Не заполнен справочник ""Магазины Авито""");
		Возврат Неопределено;
	КонецЕсли; 

	Возврат РезультатЗапроса.Выгрузить();
КонецФункции
